In [24]:
import pandas as pd

In [25]:
customers_data = pd.read_csv("Customers _data.csv")
products_data = pd.read_csv("Products_data.csv")
sales_data = pd.read_csv("Sales_data.csv")

In [26]:
customers_data.head(10)

   customer_id     customer_name gender  age              city   join_date
0          201      Ashley Silva      F   47   Lake Edwardfort  2021-01-19
1          202     Ethan Shannon      F   55        Jaredshire  2021-05-10
2          203     Colleen Lopez      M   31        South Eric  2023-07-18
3          204      Sarah Nguyen      F   52  South Wendyhaven  2020-01-23
4          205         Eric Ruiz      M   61        North Mark  2020-05-19
5          206    Kristen Kelley      F   23    North Lisaport  2022-12-13
6          207   Charles Burgess      F   24       Port Daniel  2023-06-06
7          208   Kristine Murray      M   34         Katiebury  2023-02-06
8          209     Daniel Carter      M   40       New Melissa  2021-07-25
9          210  Geoffrey Johnson      F   46    Jacquelineview  2021-09-26

In [27]:
customers_data.describe()

       customer_id         age
count   100.000000  100.000000
mean    250.500000   41.440000
std      29.011492   13.368378
min     201.000000   18.000000
25%     225.750000   30.750000
50%     250.500000   42.000000
75%     275.250000   54.000000
max     300.000000   65.000000

In [28]:
customers_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    100 non-null    int64
 1   customer_name  100 non-null    object
 2   gender         100 non-null    object
 3   age            100 non-null    int64
 4   city           100 non-null    object
 5   join_date      100 non-null    object
dtypes: int64(2), object(4)
memory usage: 4.8+ KB

In [29]:
customers_data.duplicated().sum()

0

In [30]:
customers_data.isnull().sum()

customer_id      0
customer_name    0
gender           0
age              0
city             0
join_date        0
dtype: int64

In [31]:
products_data.head(10)

   product_id  product_name     category  price
0         101        Laptop  Electronics    250
1         102    Smartphone  Electronics    300
2         103        Tablet  Electronics    240
3         104    Headphones  Electronics    100
4         105  Office Chair    Furniture    400
5         106          Desk    Furniture    350
6         107     Bookshelf    Furniture    200
7         108  Dining Table    Furniture    600
8         109       T-shirt     Clothing     20
9         110         Jeans     Clothing     50

In [32]:
products_data.describe()

       product_id       price
count   16.000000   16.000000
mean   108.500000  184.062500
std      4.760952  164.592616
min    101.000000   20.000000
25%    104.750000   50.000000
50%    108.500000  125.000000
75%    112.250000  262.500000
max    116.000000  600.000000

In [33]:
products_data.isnull().sum()

product_id      0
product_name    0
category        0
price           0
dtype: int64

In [34]:
products_data.duplicated().sum()

0

In [35]:
sales_data.head(10)

,sale_id,product_id,customer_id,quantity_sold,sale_amount,sale_date,region
0,1,107,273,5,1000,01-09-2024,South
1,2,104,212,7,700,31-05-2024,West
2,3,107,223,2,400,19-03-2024,West
3,4,103,288,1,240,21-02-2024,West
4,5,112,274,6,600,05-05-2024,West
5,6,113,296,4,100,20-12-2024,North
6,7,101,231,3,750,09-09-2024,West
7,8,107,297,9,1800,12-03-2024,East
8,9,101,232,4,1000,26-11-2024,South
9,10,111,227,7,560,08-10-2024,South

In [36]:
sales_data.isnull().sum()

sale_id          0
product_id       0
customer_id      0
quantity_sold    0
sale_amount      0
sale_date        0
region           0
dtype: int64

In [37]:
sales_data.duplicated().sum()

0

In [38]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sale_id        300 non-null    int64
 1   product_id     300 non-null    int64
 2   customer_id    300 non-null    int64
 3   quantity_sold  300 non-null    int64
 4   sale_amount    300 non-null    int64
 5   sale_date      300 non-null    object
 6   region         300 non-null    object
dtypes: int64(5), object(2)
memory usage: 16.5+ KB

In [40]:
merged_data = pd.merge(sales_data, products_data, on="product_id")

merged_data['total_sale_amount'] = merged_data['quantity_sold'] * merged_data['price']

print(merged_data.head())

   sale_id  product_id  customer_id  quantity_sold  sale_amount   sale_date  \
0        1         107          273              5         1000  01-09-2024
1        3         107          223              2          400  19-03-2024
2        8         107          297              9         1800  12-03-2024
3       17         107          294              7         1400  10-05-2024
4       30         107          298              1          200  06-11-2024

  region product_name   category  price  total_sale_amount
0  South    Bookshelf  Furniture    200               1000
1   West    Bookshelf  Furniture    200                400
2   East    Bookshelf  Furniture    200               1800
3   West    Bookshelf  Furniture    200               1400
4  South    Bookshelf  Furniture    200                200

In [44]:
merged_data.to_csv("Merged_Sales_Data_with_Total_Sale.csv", index=False)

print("Output saved to 'Merged_Sales_Data_with_Total_Sale.csv'")

Output saved to 'Merged_Sales_Data_with_Total_Sale.csv'